Revit 2026 API

# FabricAreaMajorSheetAlignment Property

---

The fabric sheet alignment in the fabric distribution in the major direction.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricSheetAlignment MajorSheetAlignment { get; set; }
```
```vb
Public Property MajorSheetAlignment As FabricSheetAlignment
	Get
	Set
```
```cpp
public:
property FabricSheetAlignment MajorSheetAlignment {
	FabricSheetAlignment get ();
	void set (FabricSheetAlignment value);
}
```
```fsharp
member MajorSheetAlignment : FabricSheetAlignment with get, set
```

#### Property Value

FabricSheetAlignment

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Changing the value of this property causes change of MajorLapSplice and LapSplicePosition properties if needed

#### Reference

FabricArea Class

Autodesk.Revit.DB.Structure Namespace